# NonContinuousRailStructure Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
NonContinuousRailStructure Class
Members See Also
---
A class that represents a collection of Non-Continuous Rails being a part of Railing Type.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public class NonContinuousRailStructure : IDisposable
```

Visual Basic
---
```text
Public Class NonContinuousRailStructure _
	Implements IDisposable
```

Visual C++
---
```text
public ref class NonContinuousRailStructure : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Architecture..::..NonContinuousRailStructure
# See Also
NonContinuousRailStructure Members
Autodesk.Revit.DB.Architecture Namespace